Repository: cc-nogueira/flutter_l10n_tool
Catalog: packages/_domain_layer/lib/src/l10n/domain_*.arb
Languages: pt

# label_display_option
source: {option, select, compact{Compact} expanded{Expanded}}
pt: {option, select, compact{Compacto} expanded{Expandido} other{X}}

# error_l10n
source: L10n error
pt: Erro L10n

# error_invalid_configuration_file
source: Invalid localization configuration file: l10n.yaml.
pt: Arquivo de configuração de localização inválido: l10n.yaml

# error_missing_pubspec
source: Could not find pubspec.yaml file in this folder.
pt: Não foi possível encontrar o arquivo pubspec.yaml nesta pasta.

# error_missing_pubspec_dependency
source: Could not find required dependency "{name}" in pubspec.yaml.
pt: Não foi possível encontrar a dependência obrigatória "{name}" no pubspec.yaml

# error_missing_arb_folder
source: Missing ARB folder: {path}.
pt: Pasta ARB não encontrada: {path}

# error_missing_arb_template_file
source: Missing ARB template file: {path}
pt: Arquivo template ARB não encontrado: {path}

# error_invalid_arb_file_format
source: Invalid content in ARB file: {name}
pt: Conteúdo inválido no aquivo ARB: {name}

# error_incomplete_pubspec_dependency
source: Incomplete dependency specification for "{name}"
pt: Dependência incompleta na declaração de "{name}"

# error_locale_specification
source: Make sure that the locale is specified in the file's '@@locale' property or as part of the filename (e.g. file_en.arb) for: {name}
pt: Tenha certeza de especificar a locale na propriedade '@@locale' ou como parte do nome do arquivo (e.g. file_pt.arb) for: {name}

# error_multiple_files_with_same_locale
source: Multiple arb files with the same "{locale}" locale detected.
pt: Detectado multiplos arquivos ARB para a mesma locale "{locale}".

# error_arb_global_resource_format
source: Global resource "{id}" should have a string value.
pt: O elemento global "{id}" precisa ter um valor string.

# error_arb_translation_format
source: Resource "{id}" should have a string value.
pt: O elemento "{id}" deveria ter um valor do tipo string.

# error_arb_definition_format
source: Ensure that resource "{id}" value is a map with string valued keys.
pt: Tenha certeza que valor do elemento "{id}" é um mapa com chaves do tipo string.

# error_arb_missing_a_definition
source: Resource attribute "{id}" was not found. Please ensure that each resource has a corresponding @resource.
pt: Não foi encontrado attributo para o elemento "{id}". Por favor garanta que cada elemento tenha um elemento @resource correspondente.

# error_arb_missing_definition
source: Resource attribute "{id}" was not found. Please ensure that {type} resources have a corresponding @resource.
pt: Não foi encontrado atributo para o elemento "{id}". Por favor garanta que elementos do tipo {type} tenham um elemento @resource correspondente.

# error_arb_missing_placeholders
source: Unable to find placeholders for the {type} message: {id}.
pt: Não foi encontrado placeholders para a mensagem do tipo {type} em: {id}.

# error_arb_missing_placeholder
source: Unable to find "{name}" placeholder in the {type} message: {id}
pt: Não foi encontrado o placeholder "{name}" para a mensagem do tipo {type} em: {id}

# error_arb_placeholders_format
source: The "placeholders" attribute for "{id}" is not properly formatted. Ensure that it is a map with string valued keys.
pt: O atributo "placeholders" para o elemento "{id}" não está formatado corretamente. Garanta que seja um mapa com chaves do tipo string.
